In [5]:
import pandas as pd
df=pd.read_excel("empdata.xlsx")
print(df.head())
print(df.shape)

   Empid           Ename    Salary        DOJ
0   1001          Ganesh   1000.00 2000-10-10
1   1002            Anil  23000.50 2002-03-20
2   1003          Gaurav       NaN 2002-03-03
3   1004    Hema Chandra  16500.50 2000-09-10
4   1005  Laxmi Prasanna  12000.75 2000-10-08
(6, 4)

In [6]:
df[: : 2]

   Empid           Ename    Salary        DOJ
0   1001          Ganesh   1000.00 2000-10-10
2   1003          Gaurav       NaN 2002-03-03
4   1005  Laxmi Prasanna  12000.75 2000-10-08

In [7]:
df.columns

Index(['Empid', 'Ename', 'Salary', 'DOJ'], dtype='object')

In [8]:
df1 = pd.concat([df, df])
print(df.shape)
print(df1.shape)

(6, 4)
(12, 4)

In [9]:
df1 = df1.drop_duplicates()
df1.shape

(6, 4)

In [10]:
df.columns = [i.upper() for i in df]
print(df.columns)

Index(['EMPID', 'ENAME', 'SALARY', 'DOJ'], dtype='object')

In [11]:
print(df.notnull())
print('The no. of nulls in each column is \n',df.notnull().sum())

   EMPID  ENAME  SALARY   DOJ
0   True   True    True  True
1   True   True    True  True
2   True   True   False  True
3   True   True    True  True
4   True   True    True  True
5   True   True    True  True
The no. of nulls in each column is
 EMPID     6
ENAME     6
SALARY    5
DOJ       6
dtype: int64

In [12]:
print('Highest Salary is',df['SALARY'].max())
print('Lowest Salary is', df['SALARY'].min())

Highest Salary is 23000.5
Lowest Salary is 1000.0

In [13]:
df[df.SALARY > 20000]

   EMPID ENAME   SALARY        DOJ
1   1002  Anil  23000.5 2002-03-20

In [14]:
df[['EMPID','ENAME']] [df.SALARY == df.SALARY.max()]

   EMPID ENAME
1   1002  Anil

In [16]:
import numpy as np
print("Dataset:\n", df)

Dataset:
    EMPID           ENAME    SALARY        DOJ
0   1001          Ganesh   1000.00 2000-10-10
1   1002            Anil  23000.50 2002-03-20
2   1003          Gaurav       NaN 2002-03-03
3   1004    Hema Chandra  16500.50 2000-09-10
4   1005  Laxmi Prasanna  12000.75 2000-10-08
5   1006          Anant    9999.99 1999-09-09

In [20]:
print("\nAverage Salary:", np.mean(df['SALARY']))
print("Maximum Salary:", np.max(df['SALARY']))
print("Minimum Salary:", np.min(df['SALARY']))

Average Salary: 12500.348
Maximum Salary: 23000.5
Minimum Salary: 1000.0